case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}

convertToMeters 0.0001;

vertices
(
     (0 0 0)
     (0 1 -0.0872595)
     (0 1 0.0872595)
     (60 0 0)
     (60 1 -0.0872595)
     (60 1 0.0872595)
);

blocks
(
     hex (0 1 2 0 3 4 5 3) (35 1 2000) simpleGrading (1 1 1)
);

edges
();

boundary
(
     axis
     {
        type empty;
        faces
        (
             (0 3 3 0)
        );
     }

     inlet
     {
        type patch;
        faces
        (
             (0 0 2 1)
        );
     }
     wall
     {
        type wall;
        faces
        (
             (2 5 4 1)
        );
     }
     outlet
     {
        type patch;
        faces
        (
             (3 4 5 3)
        );
     }

     front
     {
        type wedge;
        faces
        (
            (0 3 5 2)
        );
     }

     back
     {
        type wedge;
        faces
        (
           (0 1 4 3)
        );
     }
);

mergePatchPairs
();
