case/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


//Input for OF-2.3.0 and later
phases (water air);

air
{
    transportModel  Newtonian;
    nu    nu        [0 2 -1 0 0 0 0] 2e-05;
    rho             [1 -3 0 0 0 0 0] 945;
}

water
{
    transportModel  Newtonian;
    nu     nu       [0 2 -1 0 0 0 0] 1e-06;
    rho             [1 -3 0 0 0 0 0] 1000;
}

sigma           sigma [ 1 0 -2 0 0 0 0 ] 0.024;

surfaceTensionForce
{
	model                SST;
	Cpc                  0.2; //Interface sharpening factor
	ThresholdFactor      1E-5; //Cutoff surface tension force fluxes below this fraction of the average
	NormalFilterFactor   1.0; //Portion of non-int-normal surface tension force to cut

}


// ************************************************************************* //
