case/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.3 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0.3 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }

    wall
    {
        type            navierSlip;
        value           uniform (0 0 0);
        slipLength      uniform 1e-06;
        wallVelocity    uniform (0 0 0);

    }  

    axis
    {
	type		empty;
    }

    front
    {
        type            wedge;
    }

    back
    {
        type            wedge;
    }
}


// ************************************************************************* //
